# 자주 활용되는 판다스 예제

In [1]:
# 학습 전 실행: csv파일 (data.csv) 생성
import pandas as pd
import numpy as np
data = {
    "메뉴":['아메리카노','카페라떼','카페모카', '바닐라라떼', '녹차', '초코라떼', '바닐라콜드브루'],
    "가격":[4100, 4600, 4600, 5100, 4100, 5000, 5100],
    "할인율":[0.5, 0.1, 0.2, 0.3, 0, 0, 0],
    "칼로리":[10, 180, 420, 320, 20, 500, 400],
    "원두":['콜롬비아', np.NaN, '과테말라', np.NaN, '한국', '콜롬비아', np.NaN],
    "이벤트가":[1900, 2300, np.NaN, 2600, np.NaN, 3000, 3200],
}
data = pd.DataFrame(data)
data.to_csv('data.csv', index=False)

In [2]:
# 데이터 불러오기
df = pd.read_csv('data.csv')
df

        메뉴    가격  할인율  칼로리    원두    이벤트가
0    아메리카노  4100  0.5   10  콜롬비아  1900.0
1     카페라떼  4600  0.1  180   NaN  2300.0
2     카페모카  4600  0.2  420  과테말라     NaN
3    바닐라라떼  5100  0.3  320   NaN  2600.0
4       녹차  4100  0.0   20    한국     NaN
5     초코라떼  5000  0.0  500  콜롬비아  3000.0
6  바닐라콜드브루  5100  0.0  400   NaN  3200.0

## 조건 핉터

In [4]:
# 1개 조건
# 할인율 > 0.2
cond = df['할인율'] > 0.2
df[cond]

      메뉴    가격  할인율  칼로리    원두    이벤트가
0  아메리카노  4100  0.5   10  콜롬비아  1900.0
3  바닐라라떼  5100  0.3  320   NaN  2600.0

In [5]:
# 2개 이상 일 때 (AND)
# 할인율 >= 0.2
# 칼로리 < 400
cond1 = df['할인율'] >= 0.2
cond2 = df['칼로리'] < 400
df[cond1 & cond2]

      메뉴    가격  할인율  칼로리    원두    이벤트가
0  아메리카노  4100  0.5   10  콜롬비아  1900.0
3  바닐라라떼  5100  0.3  320   NaN  2600.0

In [6]:
# 2개 이상 일 때 (OR)
# 할인율 >= 0.2
# 칼로리 < 400
df[cond1 | cond2]

      메뉴    가격  할인율  칼로리    원두    이벤트가
0  아메리카노  4100  0.5   10  콜롬비아  1900.0
1   카페라떼  4600  0.1  180   NaN  2300.0
2   카페모카  4600  0.2  420  과테말라     NaN
3  바닐라라떼  5100  0.3  320   NaN  2600.0
4     녹차  4100  0.0   20    한국     NaN

In [7]:
# 문자열 1개 조건
# 원두 == 콜롬비아
cond3 = df['원두'] == '콜롬비아'
df[cond3]

      메뉴    가격  할인율  칼로리    원두    이벤트가
0  아메리카노  4100  0.5   10  콜롬비아  1900.0
5   초코라떼  5000  0.0  500  콜롬비아  3000.0

In [8]:
# 문자열과 숫자 조건 (AND)
# 원두 == 콜롬비아
# 가격 < 4500
cond1 = df['원두'] == '콜롬비아'
cond2 = df['가격'] < 4500
df[cond1 & cond2]

      메뉴    가격  할인율  칼로리    원두    이벤트가
0  아메리카노  4100  0.5   10  콜롬비아  1900.0

## 결측치

In [10]:
# 컬럼별 결측치 확인
df.isnull().sum()

메뉴      0
가격      0
할인율     0
칼로리     0
원두      3
이벤트가    2
dtype: int64

In [11]:
# 결측값 채우기
# 원두 -> 코스타리카로 채우기
df['원두'] = df['원두'].fillna('코스타리카')
df

        메뉴    가격  할인율  칼로리     원두    이벤트가
0    아메리카노  4100  0.5   10   콜롬비아  1900.0
1     카페라떼  4600  0.1  180  코스타리카  2300.0
2     카페모카  4600  0.2  420   과테말라     NaN
3    바닐라라떼  5100  0.3  320  코스타리카  2600.0
4       녹차  4100  0.0   20     한국     NaN
5     초코라떼  5000  0.0  500   콜롬비아  3000.0
6  바닐라콜드브루  5100  0.0  400  코스타리카  3200.0

In [12]:
# '이벤트가' 컬럼 결측치는 1900으로 결측치 채움
df['이벤트가'] = df['이벤트가'].fillna(1900)
df

        메뉴    가격  할인율  칼로리     원두    이벤트가
0    아메리카노  4100  0.5   10   콜롬비아  1900.0
1     카페라떼  4600  0.1  180  코스타리카  2300.0
2     카페모카  4600  0.2  420   과테말라  1900.0
3    바닐라라떼  5100  0.3  320  코스타리카  2600.0
4       녹차  4100  0.0   20     한국  1900.0
5     초코라떼  5000  0.0  500   콜롬비아  3000.0
6  바닐라콜드브루  5100  0.0  400  코스타리카  3200.0

## 값 변경

In [16]:
# 문자변경 : 아메리카노 -> 룽고, 녹차 -> 그란데
df = df.replace('아메리카노','룽고').replace('녹차','그린티')
df

        메뉴    가격  할인율  칼로리     원두    이벤트가
0       룽고  4100  0.5   10   콜롬비아  1900.0
1     카페라떼  4600  0.1  180  코스타리카  2300.0
2     카페모카  4600  0.2  420   과테말라  1900.0
3    바닐라라떼  5100  0.3  320  코스타리카  2600.0
4      그린티  4100  0.0   20     한국  1900.0
5     초코라떼  5000  0.0  500   콜롬비아  3000.0
6  바닐라콜드브루  5100  0.0  400  코스타리카  3200.0

In [18]:
d = {'아메리카노' : '룽고','녹차' : '그란티'}
df = df.replace(d)
df

        메뉴    가격  할인율  칼로리     원두    이벤트가
0       룽고  4100  0.5   10   콜롬비아  1900.0
1     카페라떼  4600  0.1  180  코스타리카  2300.0
2     카페모카  4600  0.2  420   과테말라  1900.0
3    바닐라라떼  5100  0.3  320  코스타리카  2600.0
4      그린티  4100  0.0   20     한국  1900.0
5     초코라떼  5000  0.0  500   콜롬비아  3000.0
6  바닐라콜드브루  5100  0.0  400  코스타리카  3200.0

In [19]:
# 숫자 변경 : 1900 -> 1500
df = df.replace(1900,1500)
df

        메뉴    가격  할인율  칼로리     원두    이벤트가
0       룽고  4100  0.5   10   콜롬비아  1500.0
1     카페라떼  4600  0.1  180  코스타리카  2300.0
2     카페모카  4600  0.2  420   과테말라  1500.0
3    바닐라라떼  5100  0.3  320  코스타리카  2600.0
4      그린티  4100  0.0   20     한국  1500.0
5     초코라떼  5000  0.0  500   콜롬비아  3000.0
6  바닐라콜드브루  5100  0.0  400  코스타리카  3200.0

In [22]:
# loc로 값 변경하기
# 바닐라라떼 원두 -> 과테말라
df.loc[3, '원두'] = '과테말라'
df

        메뉴    가격  할인율  칼로리     원두    이벤트가
0       룽고  4100  0.5   10   콜롬비아  1500.0
1     카페라떼  4600  0.1  180  코스타리카  2300.0
2     카페모카  4600  0.2  420   과테말라  1500.0
3    바닐라라떼  5100  0.3  320   과테말라  2600.0
4      그린티  4100  0.0   20     한국  1500.0
5     초코라떼  5000  0.0  500   콜롬비아  3000.0
6  바닐라콜드브루  5100  0.0  400  코스타리카  3200.0

In [23]:
# 이벤트가 전체 1000으로 변경
df.loc[:,'이벤트가'] = 1000
df

        메뉴    가격  할인율  칼로리     원두  이벤트가
0       룽고  4100  0.5   10   콜롬비아  1000
1     카페라떼  4600  0.1  180  코스타리카  1000
2     카페모카  4600  0.2  420   과테말라  1000
3    바닐라라떼  5100  0.3  320   과테말라  1000
4      그린티  4100  0.0   20     한국  1000
5     초코라떼  5000  0.0  500   콜롬비아  1000
6  바닐라콜드브루  5100  0.0  400  코스타리카  1000

## 내장함수

In [25]:
# 데이터 불러오기
df = pd.read_csv('data.csv')
df

        메뉴    가격  할인율  칼로리    원두    이벤트가
0    아메리카노  4100  0.5   10  콜롬비아  1900.0
1     카페라떼  4600  0.1  180   NaN  2300.0
2     카페모카  4600  0.2  420  과테말라     NaN
3    바닐라라떼  5100  0.3  320   NaN  2600.0
4       녹차  4100  0.0   20    한국     NaN
5     초코라떼  5000  0.0  500  콜롬비아  3000.0
6  바닐라콜드브루  5100  0.0  400   NaN  3200.0

In [27]:
# 카운트 (컬럼) # 기본값 axis = 0
df.count()

메뉴      7
가격      7
할인율     7
칼로리     7
원두      4
이벤트가    5
dtype: int64

In [28]:
# 행기준 카운트
df.count(axis=1)

0    6
1    5
2    5
3    5
4    5
5    6
6    5
dtype: int64

In [31]:
# 데이터 수 len, shape
len(df)
df.shape[0]

7

In [33]:
# 최대값
df['가격'].max()

5100

In [34]:
# 최소값
df['가격'].min()

4100

In [35]:
# 평균
df['가격'].mean()

4657.142857142857

In [36]:
# 중간값
df['가격'].median()

4600.0

In [37]:
# 합계
df['가격'].sum()

32600

In [40]:
# 표준편차
df['가격'].std()

435.3433237386437

In [41]:
# 분산
df['가격'].var()

189523.8095238095

In [42]:
# 왜도
df['가격'].skew()

-0.3739900475641664

In [43]:
# 첨도
df['가격'].kurt()

-1.7170778515694067

In [44]:
# 백분위수
df.describe()

                가격       할인율         칼로리         이벤트가
count     7.000000  7.000000    7.000000     5.000000
mean   4657.142857  0.157143  264.285714  2600.000000
std     435.343324  0.190238  196.965068   524.404424
min    4100.000000  0.000000   10.000000  1900.000000
25%    4350.000000  0.000000  100.000000  2300.000000
50%    4600.000000  0.100000  320.000000  2600.000000
75%    5050.000000  0.250000  410.000000  3000.000000
max    5100.000000  0.500000  500.000000  3200.000000

In [45]:
# 하위 25% 값
df.quantile(.25)

가격      4350.0
할인율        0.0
칼로리      100.0
이벤트가    2300.0
Name: 0.25, dtype: float64

In [47]:
# 상위 25% 값
df.quantile(.75)

가격      5050.00
할인율        0.25
칼로리      410.00
이벤트가    3000.00
Name: 0.75, dtype: float64

In [49]:
# 하위 25% 데이터
cond = df['가격'].quantile(.25) > df['가격']
df[cond]

      메뉴    가격  할인율  칼로리    원두    이벤트가
0  아메리카노  4100  0.5   10  콜롬비아  1900.0
4     녹차  4100  0.0   20    한국     NaN

In [50]:
# 상위 25% 데이터
cond = df['가격'].quantile(.75) < df['가격']
df[cond]

        메뉴    가격  할인율  칼로리   원두    이벤트가
3    바닐라라떼  5100  0.3  320  NaN  2600.0
6  바닐라콜드브루  5100  0.0  400  NaN  3200.0

In [53]:
# 최빈값 구하기
df['원두'].mode()

0    콜롬비아
dtype: object

## 그룹핑

In [54]:
# 원두 기준, 평균
df.groupby('원두').mean()

          가격   할인율    칼로리    이벤트가
원두
과테말라  4600.0  0.20  420.0     NaN
콜롬비아  4550.0  0.25  255.0  2450.0
한국    4100.0  0.00   20.0     NaN

In [55]:
# 원두와 할인율 기준, 평균
df.groupby(['원두','할인율']).mean()

              가격    칼로리    이벤트가
원두   할인율
과테말라 0.2  4600.0  420.0     NaN
콜롬비아 0.0  5000.0  500.0  3000.0
     0.5  4100.0   10.0  1900.0
한국   0.0  4100.0   20.0     NaN

In [56]:
# 원두와 할인율 기준, 가격 평균
df.groupby(['원두','할인율'])['가격'].mean()

원두    할인율
과테말라  0.2    4600.0
콜롬비아  0.0    5000.0
      0.5    4100.0
한국    0.0    4100.0
Name: 가격, dtype: float64

In [57]:
# 데이터 프레임으로 변환
pd.DataFrame(df.groupby(['원두','할인율'])['가격'].mean())

              가격
원두   할인율
과테말라 0.2  4600.0
콜롬비아 0.0  5000.0
     0.5  4100.0
한국   0.0  4100.0

In [59]:
# 1개 인덱스 형태로 리셋
df.groupby(['원두','할인율']).mean().reset_index()

     원두  할인율      가격    칼로리    이벤트가
0  과테말라  0.2  4600.0  420.0     NaN
1  콜롬비아  0.0  5000.0  500.0  3000.0
2  콜롬비아  0.5  4100.0   10.0  1900.0
3    한국  0.0  4100.0   20.0     NaN